nxp-appcodehub/ap-ml-state-monitor/ml_state_monitor/mcu_app/boards/lpcxpresso55s69/ml_state_monitor_mpp/pin_mux.c
/*
 * Copyright 2017-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: LPC55S69
package_id: LPC55S69JBD100
mcu_data: ksdk2_0
processor_version: 6.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iocon.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
	BOARD_InitPins();

	if (Chip_GetVersion()==1)
	{
		const uint32_t port0_pin15_config = (/* Pin is configured as SD0_WR_PRT */
				IOCON_PIO_FUNC5 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch is closed (enabled) */
				IOCON_PIO_ASW_EN);
		/* PORT0 PIN15 (coords: 22) is configured as SD0_WR_PRT */
		IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);
	}
	else
	{
		const uint32_t port0_pin15_config = (/* Pin is configured as SD0_WR_PRT */
				IOCON_PIO_FUNC5 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch is closed (enabled), only for A0 version */
				IOCON_PIO_ASW_DIS_EN);
		/* PORT0 PIN15 (coords: 22) is configured as SD0_WR_PRT */
		IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);
	}

	const uint32_t port0_pin17_config = (/* Pin is configured as SD0_CARD_DET_N */
			IOCON_PIO_FUNC2 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN17 (coords: 8) is configured as SD0_CARD_DET_N */
	IOCON_PinMuxSet(IOCON, 0U, 17U, port0_pin17_config);

	const uint32_t port0_pin24_config = (/* Pin is configured as SD0_D0 */
			IOCON_PIO_FUNC2 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN24 (coords: 70) is configured as SD0_D0 */
	IOCON_PinMuxSet(IOCON, 0U, 24U, port0_pin24_config);

	const uint32_t port0_pin25_config = (/* Pin is configured as SD0_D1 */
			IOCON_PIO_FUNC2 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN25 (coords: 79) is configured as SD0_D1 */
	IOCON_PinMuxSet(IOCON, 0U, 25U, port0_pin25_config);

	if (Chip_GetVersion()==1)
	{
		const uint32_t port0_pin31_config = (/* Pin is configured as SD0_D2 */
				IOCON_PIO_FUNC2 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Fast mode, slew rate control is disabled */
				IOCON_PIO_SLEW_FAST |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch is closed (enabled) */
				IOCON_PIO_ASW_EN);
		/* PORT0 PIN31 (coords: 23) is configured as SD0_D2 */
		IOCON_PinMuxSet(IOCON, 0U, 31U, port0_pin31_config);
	}
	else
	{
		const uint32_t port0_pin31_config = (/* Pin is configured as SD0_D2 */
				IOCON_PIO_FUNC2 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Fast mode, slew rate control is disabled */
				IOCON_PIO_SLEW_FAST |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch is closed (enabled), only for A0 version */
				IOCON_PIO_ASW_DIS_EN);
		/* PORT0 PIN31 (coords: 23) is configured as SD0_D2 */
		IOCON_PinMuxSet(IOCON, 0U, 31U, port0_pin31_config);
	}

	const uint32_t port0_pin7_config = (/* Pin is configured as SD0_CLK */
			IOCON_PIO_FUNC2 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN7 (coords: 6) is configured as SD0_CLK */
	IOCON_PinMuxSet(IOCON, 0U, 7U, port0_pin7_config);

	const uint32_t port0_pin8_config = (/* Pin is configured as SD0_CMD */
			IOCON_PIO_FUNC2 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT0 PIN8 (coords: 26) is configured as SD0_CMD */
	IOCON_PinMuxSet(IOCON, 0U, 8U, port0_pin8_config);

